andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/bsp/stable/soc/nrfx_soc_defines.h
/*
 * Copyright (c) 2025, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef NRFX_SOC_DEFINES_H__
#define NRFX_SOC_DEFINES_H__

#include <nrfx.h>

#ifdef __cplusplus
extern "C" {
#endif

/* Analog pins definitions. */

#if defined(NRF54LV10A_ENGA_XXAA)
#define ANALOG_REF_INTERNAL_VAL 1300
#elif defined(HALTIUM_XXAA) || defined(NRF7120_ENGA_XXAA) || defined(NRF54LS05B_ENGA_XXAA)
#define ANALOG_REF_INTERNAL_VAL 1024
#elif defined(LUMOS_XXAA)
#define ANALOG_REF_INTERNAL_VAL 900
#else
#define ANALOG_REF_INTERNAL_VAL 600
#endif

#if defined(HALTIUM_XXAA)
    #define COMP_EXTERNAL_AIN_PSELS        \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1)
#elif defined(NRF54L05_XXAA) || defined(NRF54L10_XXAA) || defined(NRF54L15_XXAA)
    #define COMP_EXTERNAL_AIN_PSELS         \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(11U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(12U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(13U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(14U, 1)
#elif defined(NRF54LM20A_XXAA)
    #define COMP_EXTERNAL_AIN_PSELS         \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(31U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(30U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(29U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1)
#elif defined(NRF54LV10A_ENGA_XXAA)
    #define COMP_EXTERNAL_AIN_PSELS         \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(10U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(11U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(12U, 1)
#elif defined(NRF54LS05B_ENGA_XXAA)
    #define COMP_EXTERNAL_AIN_PSELS         \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1)
#elif defined(NRF7120_ENGA_XXAA)
    #define COMP_EXTERNAL_AIN_PSELS                     \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 0),              \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 0),              \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 0),              \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 0),              \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 0),              \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 0),              \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 0),              \
        NRF_PIN_PORT_TO_PIN_NUMBER(8U, 0),              \
        (nrf_comp_input_t)NRFX_COMP_INPUT_NOT_PRESENT,  \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 4),              \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 4),              \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 4),              \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 4),              \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 4),              \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 4)
#else /* legacy platforms */
    #define COMP_EXTERNAL_AIN_PSELS                                             \
        NRF_COMP_INPUT_0,                                                       \
        NRF_COMP_INPUT_1,                                                       \
        NRF_COMP_INPUT_2,                                                       \
        NRF_COMP_INPUT_3,                                                       \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(COMP_PSEL_PSEL_AnalogInput4), \
            (NRF_COMP_INPUT_4,), ())                                            \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(COMP_PSEL_PSEL_AnalogInput5), \
            (NRF_COMP_INPUT_5,), ())                                            \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(COMP_PSEL_PSEL_AnalogInput6), \
            (NRF_COMP_INPUT_6,), ())                                            \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(COMP_PSEL_PSEL_AnalogInput7), \
            (NRF_COMP_INPUT_7,), ())
#endif

