andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/bsp/stable/soc/nrfx_soc_defines.h
#if defined(HALTIUM_XXAA)
    #define COMP_EXTERNAL_REF_PSELS        \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),
#elif defined(NRF54L05_XXAA) || defined(NRF54L10_XXAA) || defined(NRF54L15_XXAA)
    #define COMP_EXTERNAL_REF_PSELS         \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(11U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(12U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(13U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(14U, 1),
#elif defined(NRF54LM20A_XXAA)
    #define COMP_EXTERNAL_REF_PSELS         \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(31U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(30U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(29U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1),
#elif defined(NRF54LV10A_ENGA_XXAA)
    #define COMP_EXTERNAL_REF_PSELS         \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(10U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(11U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(12U, 1),
#elif defined(NRF54LS05B_ENGA_XXAA)
    #define COMP_EXTERNAL_REF_PSELS        \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),
#elif defined(NRF7120_ENGA_XXAA)
    #define COMP_EXTERNAL_REF_PSELS                      \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 0),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 0),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 0),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 0),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 0),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 0),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 0),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(8U, 0),               \
        (nrf_comp_ext_ref_t)NRFX_COMP_INPUT_NOT_PRESENT, \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 4),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 4),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 4),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 4),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 4),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 4),
#else /* legacy platforms */
    #define COMP_EXTERNAL_REF_PSELS                                                           \
        NRF_COMP_EXT_REF_0,                                                                   \
        NRF_COMP_EXT_REF_1,                                                                   \
        NRF_COMP_EXT_REF_2,                                                                   \
        NRF_COMP_EXT_REF_3,                                                                   \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(COMP_EXTREFSEL_EXTREFSEL_AnalogReference4), \
            (NRF_COMP_EXT_REF_4,), ())                                                        \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(COMP_EXTREFSEL_EXTREFSEL_AnalogReference5), \
            (NRF_COMP_EXT_REF_5,), ())                                                        \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(COMP_EXTREFSEL_EXTREFSEL_AnalogReference6), \
            (NRF_COMP_EXT_REF_6,), ())                                                        \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(COMP_EXTREFSEL_EXTREFSEL_AnalogReference7), \
            (NRF_COMP_EXT_REF_7,), ())
#endif

#if defined(HALTIUM_XXAA)
    #define LPCOMP_EXTERNAL_AIN_PSELS      \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),
#elif defined(NRF54L05_XXAA) || defined(NRF54L10_XXAA) || defined(NRF54L15_XXAA)
    #define LPCOMP_EXTERNAL_AIN_PSELS       \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(11U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(12U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(13U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(14U, 1),
#elif defined(NRF54LM20A_XXAA)
    #define LPCOMP_EXTERNAL_AIN_PSELS       \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(31U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(30U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(29U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1),
#elif defined(NRF54LV10A_ENGA_XXAA)
    #define LPCOMP_EXTERNAL_AIN_PSELS       \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(10U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(11U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(12U, 1),
#elif defined(NRF54LS05B_ENGA_XXAA)
    #define LPCOMP_EXTERNAL_AIN_PSELS      \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),
#elif defined(NRF7120_ENGA_XXAA)
    #define LPCOMP_EXTERNAL_AIN_PSELS                      \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 0),                 \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 0),                 \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 0),                 \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 0),                 \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 0),                 \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 0),                 \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 0),                 \
        NRF_PIN_PORT_TO_PIN_NUMBER(8U, 0),                 \
        (nrf_lpcomp_input_t)NRFX_LPCOMP_INPUT_NOT_PRESENT, \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 4),                 \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 4),                 \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 4),                 \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 4),                 \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 4),                 \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 4),
#else /* legacy platforms */
    #define LPCOMP_EXTERNAL_AIN_PSELS \
        NRF_LPCOMP_INPUT_0,           \
        NRF_LPCOMP_INPUT_1,           \
        NRF_LPCOMP_INPUT_2,           \
        NRF_LPCOMP_INPUT_3,           \
        NRF_LPCOMP_INPUT_4,           \
        NRF_LPCOMP_INPUT_5,           \
        NRF_LPCOMP_INPUT_6,           \
        NRF_LPCOMP_INPUT_7,
#endif

