andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/bsp/stable/soc/nrfx_soc_defines.h
#if defined(HALTIUM_XXAA)
    #define LPCOMP_EXTERNAL_REF_PSELS      \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),
#elif defined(NRF54L05_XXAA) || defined(NRF54L10_XXAA) || defined(NRF54L15_XXAA)
    #define LPCOMP_EXTERNAL_REF_PSELS       \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(11U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(12U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(13U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(14U, 1),
#elif defined(NRF54LM20A_XXAA)
    #define LPCOMP_EXTERNAL_REF_PSELS       \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(31U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(30U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(29U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1),
#elif defined(NRF54LV10A_ENGA_XXAA)
    #define LPCOMP_EXTERNAL_REF_PSELS       \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(10U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(11U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(12U, 1),
#elif defined(NRF54LS05B_ENGA_XXAA)
    #define LPCOMP_EXTERNAL_REF_PSELS      \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),
#elif defined(NRF7120_ENGA_XXAA)
    #define LPCOMP_EXTERNAL_REF_PSELS                    \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 0),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 0),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 0),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 0),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 0),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 0),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 0),               \
        NRF_PIN_PORT_TO_PIN_NUMBER(8U, 0),               \
    (nrf_lpcomp_ext_ref_t)NRFX_LPCOMP_INPUT_NOT_PRESENT, \
    NRF_PIN_PORT_TO_PIN_NUMBER(0U, 4),                   \
    NRF_PIN_PORT_TO_PIN_NUMBER(1U, 4),                   \
    NRF_PIN_PORT_TO_PIN_NUMBER(2U, 4),                   \
    NRF_PIN_PORT_TO_PIN_NUMBER(3U, 4),                   \
    NRF_PIN_PORT_TO_PIN_NUMBER(4U, 4),                   \
    NRF_PIN_PORT_TO_PIN_NUMBER(5U, 4),
#else /* legacy platforms */
    #define LPCOMP_EXTERNAL_REF_PSELS \
        NRF_LPCOMP_EXT_REF_REF0,      \
        NRF_LPCOMP_EXT_REF_REF1,
#endif

#if defined(HALTIUM_XXAA)
    #define SAADC_EXTERNAL_AIN_PSELS       \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 9), \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 9), \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 9), \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 9), \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 9), \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 9),
#elif defined(NRF54L05_XXAA) || defined(NRF54L10_XXAA) || defined(NRF54L15_XXAA)
    #define SAADC_EXTERNAL_AIN_PSELS       \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(11U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(12U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(13U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(14U, 1),
#elif defined(NRF54LM20A_XXAA)
    #define SAADC_EXTERNAL_AIN_PSELS        \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(31U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(30U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(29U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1),
#elif defined(NRF54LV10A_ENGA_XXAA)
    #define SAADC_EXTERNAL_AIN_PSELS        \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),  \
        NRF_PIN_PORT_TO_PIN_NUMBER(10U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(11U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(12U, 1),
#elif defined(NRF54LS05B_ENGA_XXAA)
    #define SAADC_EXTERNAL_AIN_PSELS       \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 1), \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 1),
#elif defined(NRF7120_ENGA_XXAA)
    #define SAADC_EXTERNAL_AIN_PSELS       \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 0), \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 0), \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 0), \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 0), \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 0), \
        NRF_PIN_PORT_TO_PIN_NUMBER(6U, 0), \
        NRF_PIN_PORT_TO_PIN_NUMBER(7U, 0), \
        NRF_PIN_PORT_TO_PIN_NUMBER(8U, 0), \
        NRFX_SAADC_INPUT_NOT_PRESENT,      \
        NRF_PIN_PORT_TO_PIN_NUMBER(0U, 4), \
        NRF_PIN_PORT_TO_PIN_NUMBER(1U, 4), \
        NRF_PIN_PORT_TO_PIN_NUMBER(2U, 4), \
        NRF_PIN_PORT_TO_PIN_NUMBER(3U, 4), \
        NRF_PIN_PORT_TO_PIN_NUMBER(4U, 4), \
        NRF_PIN_PORT_TO_PIN_NUMBER(5U, 4),
#else /* legacy platforms */
    #define SAADC_EXTERNAL_AIN_PSELS                                                   \
        NRF_SAADC_INPUT_AIN0,                                                          \
        NRF_SAADC_INPUT_AIN1,                                                          \
        NRF_SAADC_INPUT_AIN2,                                                          \
        NRF_SAADC_INPUT_AIN3,                                                          \
        NRF_SAADC_INPUT_AIN4,                                                          \
        NRF_SAADC_INPUT_AIN5,                                                          \
        NRF_SAADC_INPUT_AIN6,                                                          \
        NRF_SAADC_INPUT_AIN7,                                                          \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(SAADC_CH_PSELP_PSELP_AnalogInput8),  \
            (NRF_SAADC_INPUT_AIN8,), ())                                               \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(SAADC_CH_PSELP_PSELP_AnalogInput9),  \
            (NRF_SAADC_INPUT_AIN9,), ())                                               \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(SAADC_CH_PSELP_PSELP_AnalogInput10), \
            (NRF_SAADC_INPUT_AIN10,), ())                                              \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(SAADC_CH_PSELP_PSELP_AnalogInput11), \
            (NRF_SAADC_INPUT_AIN11,), ())                                              \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(SAADC_CH_PSELP_PSELP_AnalogInput12), \
            (NRF_SAADC_INPUT_AIN812,), ())                                             \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(SAADC_CH_PSELP_PSELP_AnalogInput13), \
            (NRF_SAADC_INPUT_AIN13,), ())
#endif

#if defined(NRF54L05_XXAA) || defined(NRF54L10_XXAA) || defined(NRF54L15_XXAA)
    #define SAADC_INTERNAL_AIN_PSELS                                     \
        NRF_SAADC_INPUT_VDD,                                             \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                    \
        NRF_SAADC_INPUT_AVDD,                                            \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(NRF_SAADC_INPUT_DVDD), \
            (NRF_SAADC_INPUT_DVDD,), (NRFX_SAADC_INPUT_NOT_PRESENT,))
#elif defined(NRF54LM20A_XXAA)
    #define SAADC_INTERNAL_AIN_PSELS                                     \
        NRF_SAADC_INPUT_VDD,                                             \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                    \
        NRF_SAADC_INPUT_AVDD,                                            \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(NRF_SAADC_INPUT_DVDD), \
            (NRF_SAADC_INPUT_DVDD,), (NRFX_SAADC_INPUT_NOT_PRESENT,))
#elif defined(NRF54LV10A_ENGA_XXAA)
    #define SAADC_INTERNAL_AIN_PSELS                                     \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                    \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                    \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                    \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(NRF_SAADC_INPUT_DVDD), \
            (NRF_SAADC_INPUT_DVDD,), (NRFX_SAADC_INPUT_NOT_PRESENT,))    \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                    \
        NRF_SAADC_INPUT_VDDL,                                            \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                    \
        NRF_SAADC_INPUT_VSS,
#elif defined(NRF54LS05B_ENGA_XXAA)
    #define SAADC_INTERNAL_AIN_PSELS                                     \
        NRF_SAADC_INPUT_VDD,                                             \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                    \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                    \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(NRF_SAADC_INPUT_DVDD), \
            (NRF_SAADC_INPUT_DVDD,), (NRFX_SAADC_INPUT_NOT_PRESENT,))    \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                    \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                    \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                    \
        NRF_SAADC_INPUT_VSS,
#elif defined(NRF7120_ENGA_XXAA)
    #define SAADC_INTERNAL_AIN_PSELS  \
        NRFX_SAADC_INPUT_NOT_PRESENT, \
        NRFX_SAADC_INPUT_NOT_PRESENT, \
        NRFX_SAADC_INPUT_NOT_PRESENT, \
        NRFX_SAADC_INPUT_NOT_PRESENT, \
        NRFX_SAADC_INPUT_NOT_PRESENT, \
        NRFX_SAADC_INPUT_NOT_PRESENT, \
        NRFX_SAADC_INPUT_NOT_PRESENT, \
        NRFX_SAADC_INPUT_NOT_PRESENT, \
        NRFX_SAADC_INPUT_NOT_PRESENT, \
        NRF_SAADC_INPUT_INTERNAL0,    \
        NRF_SAADC_INPUT_INTERNAL1,    \
        NRF_SAADC_INPUT_INTERNAL2,    \
        NRF_SAADC_INPUT_INTERNAL3,
#else  /* legacy platforms */
    #define SAADC_INTERNAL_AIN_PSELS                                              \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(SAADC_CH_PSELP_PSELP_VDD),      \
            (NRF_SAADC_INPUT_VDD,), (NRFX_SAADC_INPUT_NOT_PRESENT,))              \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                             \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                             \
        NRFX_SAADC_INPUT_NOT_PRESENT,                                             \
        NRFX_COND_CODE_1(NRFX_ARG_HAS_PARENTHESIS(SAADC_CH_PSELP_PSELP_VDDHDIV5), \
            (NRF_SAADC_INPUT_VDDHDIV5,), (NRFX_SAADC_INPUT_NOT_PRESENT,))
#endif

/* Ram sections definitions. */

#define RAM_NON_UNIFORM_SECTION_DECLARE(i, _block, _section) {.decoded = {_block, _section}}

#if defined(NRF51)
#define RAM_SECTION_UNIT_SIZE          8192
#define RAM_UNIFORM_BLOCKS             4
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 1
#define RAM_UNIFORM_SECTIONS_TOTAL     4
#elif defined(NRF52805_XXAA) || defined(NRF52810_XXAA) || defined(NRF52811_XXAA)
#define RAM_SECTION_UNIT_SIZE          4096
#define RAM_UNIFORM_BLOCKS             3
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 2
#define RAM_UNIFORM_SECTIONS_TOTAL     6
#elif defined(NRF52820_XXAA)
#define RAM_SECTION_UNIT_SIZE          4096
#define RAM_UNIFORM_BLOCKS             4
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 2
#define RAM_UNIFORM_SECTIONS_TOTAL     8
#elif defined(NRF52832_XXAA)
#define RAM_SECTION_UNIT_SIZE          4096
#define RAM_UNIFORM_BLOCKS             8
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 2
#define RAM_UNIFORM_SECTIONS_TOTAL     16
#elif defined(NRF52833_XXAA)
#define RAM_SECTION_UNIT_SIZE          4096
#define RAM_UNIFORM_BLOCKS             8
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 2
#define RAM_UNIFORM_SECTIONS_TOTAL     16
#define RAM_NON_UNIFORM_BLOCK_INDEX    8
#define RAM_NON_UNIFORM_BLOCK_UNITS    8
#define RAM_NON_UNIFORM_SECTIONS                                                               \
    NRFX_LISTIFY(RAM_NON_UNIFORM_BLOCK_UNITS,                                                  \
                 RAM_NON_UNIFORM_SECTION_DECLARE, (,),                                         \
                 RAM_NON_UNIFORM_BLOCK_INDEX, 0), /* Section 0 of block 8 - 8 * 4 kB units. */ \
    NRFX_LISTIFY(RAM_NON_UNIFORM_BLOCK_UNITS,                                                  \
                 RAM_NON_UNIFORM_SECTION_DECLARE, (,),                                         \
                 RAM_NON_UNIFORM_BLOCK_INDEX, 1)  /* Section 1 of block 8 - 8 * 4 kB units. */
#elif defined(NRF52840_XXAA)
#define RAM_SECTION_UNIT_SIZE          4096
#define RAM_UNIFORM_BLOCKS             8
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 2
#define RAM_UNIFORM_SECTIONS_TOTAL     16
#define RAM_NON_UNIFORM_BLOCK_INDEX    8
#define RAM_NON_UNIFORM_BLOCK_UNITS    8
#define RAM_NON_UNIFORM_SECTIONS                                                               \
    NRFX_LISTIFY(RAM_NON_UNIFORM_BLOCK_UNITS,                                                  \
                 RAM_NON_UNIFORM_SECTION_DECLARE, (,),                                         \
                 RAM_NON_UNIFORM_BLOCK_INDEX, 0), /* Section 0 of block 8 - 8 * 4 kB units. */ \
    NRFX_LISTIFY(RAM_NON_UNIFORM_BLOCK_UNITS,                                                  \
                 RAM_NON_UNIFORM_SECTION_DECLARE, (,),                                         \
                 RAM_NON_UNIFORM_BLOCK_INDEX, 1), /* Section 1 of block 8 - 8 * 4 kB units. */ \
    NRFX_LISTIFY(RAM_NON_UNIFORM_BLOCK_UNITS,                                                  \
                 RAM_NON_UNIFORM_SECTION_DECLARE, (,),                                         \
                 RAM_NON_UNIFORM_BLOCK_INDEX, 2), /* Section 2 of block 8 - 8 * 4 kB units. */ \
    NRFX_LISTIFY(RAM_NON_UNIFORM_BLOCK_UNITS,                                                  \
                 RAM_NON_UNIFORM_SECTION_DECLARE, (,),                                         \
                 RAM_NON_UNIFORM_BLOCK_INDEX, 3), /* Section 3 of block 8 - 8 * 4 kB units. */ \
    NRFX_LISTIFY(RAM_NON_UNIFORM_BLOCK_UNITS,                                                  \
                 RAM_NON_UNIFORM_SECTION_DECLARE, (,),                                         \
                 RAM_NON_UNIFORM_BLOCK_INDEX, 4), /* Section 4 of block 8 - 8 * 4 kB units. */ \
    NRFX_LISTIFY(RAM_NON_UNIFORM_BLOCK_UNITS,                                                  \
                 RAM_NON_UNIFORM_SECTION_DECLARE, (,),                                         \
                 RAM_NON_UNIFORM_BLOCK_INDEX, 5)  /* Section 5 of block 8 - 8 * 4 kB units. */
#elif defined(NRF5340_XXAA_APPLICATION)
#define RAM_SECTION_UNIT_SIZE          4096
#define RAM_UNIFORM_BLOCKS             8
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 16
#define RAM_UNIFORM_SECTIONS_TOTAL     128
#elif defined(NRF5340_XXAA_NETWORK)
#define RAM_SECTION_UNIT_SIZE          4096
#define RAM_UNIFORM_BLOCKS             4
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 4
#define RAM_UNIFORM_SECTIONS_TOTAL     16
#elif defined(NRF54H20_XXAA) && defined(NRF_APPLICATION)
#define RAM_SECTION_UNIT_SIZE          (32UL * 1024UL)
#define RAM_UNIFORM_BLOCKS             1
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 1
#define RAM_UNIFORM_SECTIONS_TOTAL     1
#elif defined(NRF54H20_XXAA) && defined(NRF_RADIOCORE)
#define RAM_SECTION_UNIT_SIZE          (2UL * 16UL * 1024UL) /* Consider both banks as single unit */
#define RAM_UNIFORM_BLOCKS             1
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 6
#define RAM_UNIFORM_SECTIONS_TOTAL     6
#elif defined(NRF54L05_XXAA)
#define RAM_SECTION_UNIT_SIZE          (32UL * 1024UL)
#define RAM_UNIFORM_BLOCKS             1
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 3
#define RAM_UNIFORM_SECTIONS_TOTAL     3
#elif defined(NRF54L10_XXAA)
#define RAM_SECTION_UNIT_SIZE          (32UL * 1024UL)
#define RAM_UNIFORM_BLOCKS             1
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 6
#define RAM_UNIFORM_SECTIONS_TOTAL     6
#elif defined(NRF54L15_XXAA)
#define RAM_SECTION_UNIT_SIZE          (32UL * 1024UL)
#define RAM_UNIFORM_BLOCKS             1
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 8
#define RAM_UNIFORM_SECTIONS_TOTAL     8
#elif defined(NRF54LM20A_XXAA)
#define RAM_SECTION_UNIT_SIZE          (32UL * 1024UL)
#define RAM_UNIFORM_BLOCKS             1
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 16
#define RAM_UNIFORM_SECTIONS_TOTAL     16
#elif defined(NRF54LS05B_ENGA_XXAA)
#define RAM_SECTION_UNIT_SIZE          (32UL * 1024UL)
#define RAM_UNIFORM_BLOCKS             1
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 2
#define RAM_UNIFORM_SECTIONS_TOTAL     2
#elif defined(NRF54LV10A_ENGA_XXAA)
#define RAM_SECTION_UNIT_SIZE          (32UL * 1024UL)
#define RAM_UNIFORM_BLOCKS             1
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 6
#define RAM_UNIFORM_SECTIONS_TOTAL     6
#elif defined(NRF9120_XXAA) || defined(NRF9160_XXAA)
#define RAM_SECTION_UNIT_SIZE          8192
#define RAM_UNIFORM_BLOCKS             8
#define RAM_UNIFORM_SECTIONS_PER_BLOCK 4
#define RAM_UNIFORM_SECTIONS_TOTAL     32
#endif

/* PRS boxes definitions. */

