andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/bsp/stable/soc/nrfx_soc_defines.h
#if defined(NRF51)
    // SPI0, TWI0
    #define NRFX_PRS_BOX_0_ADDR     NRF_SPI0
    // SPI1, SPIS1, TWI1
    #define NRFX_PRS_BOX_1_ADDR     NRF_SPI1
#elif defined(NRF52805_XXAA) || defined(NRF52810_XXAA)
    // TWIM0, TWIS0, TWI0
    #define NRFX_PRS_BOX_0_ADDR     NRF_TWIM0
    // SPIM0, SPIS0, SPI0
    #define NRFX_PRS_BOX_1_ADDR     NRF_SPIM0
    // UARTE0, UART0
    #define NRFX_PRS_BOX_2_ADDR     NRF_UARTE0
#elif defined(NRF52811_XXAA)
    // TWIM0, TWIS0, TWI0, SPIM1, SPIS1, SPI1
    #define NRFX_PRS_BOX_0_ADDR     NRF_TWIM0
    // SPIM0, SPIS0, SPI0
    #define NRFX_PRS_BOX_1_ADDR     NRF_SPIM0
    // UART0, UARTE0
    #define NRFX_PRS_BOX_2_ADDR     NRF_UART0
#elif defined(NRF52820_XXAA)
    // SPIM0, SPIS0, TWIM0, TWIS0, SPI0, TWI0
    #define NRFX_PRS_BOX_0_ADDR     NRF_SPIM0
    // SPIM1, SPIS1, TWIM1, TWIS1, SPI1, TWI1
    #define NRFX_PRS_BOX_1_ADDR     NRF_SPIM1
    // UARTE0, UART0
    #define NRFX_PRS_BOX_2_ADDR     NRF_UARTE0
#elif defined(NRF52832_XXAA) || defined(NRF52832_XXAB) || \
      defined(NRF52833_XXAA) || defined(NRF52840_XXAA)
    // SPIM0, SPIS0, TWIM0, TWIS0, SPI0, TWI0
    #define NRFX_PRS_BOX_0_ADDR     NRF_SPIM0
    // SPIM1, SPIS1, TWIM1, TWIS1, SPI1, TWI1
    #define NRFX_PRS_BOX_1_ADDR     NRF_SPIM1
    // SPIM2, SPIS2, SPI2
    #define NRFX_PRS_BOX_2_ADDR     NRF_SPIM2
    // COMP, LPCOMP
    #define NRFX_PRS_BOX_3_ADDR     NRF_COMP
    // UARTE0, UART0
    #define NRFX_PRS_BOX_4_ADDR     NRF_UARTE0
#elif defined(NRF5340_XXAA_APPLICATION)
    // SPIM0, SPIS0, TWIM0, TWIS0, UARTE0
    #define NRFX_PRS_BOX_0_ADDR     NRF_UARTE0
    // SPIM1, SPIS1, TWIM1, TWIS1, UARTE1
    #define NRFX_PRS_BOX_1_ADDR     NRF_UARTE1
    // SPIM2, SPIS2, TWIM2, TWIS2, UARTE2
    #define NRFX_PRS_BOX_2_ADDR     NRF_UARTE2
    // SPIM3, SPIS3, TWIM3, TWIS3, UARTE3
    #define NRFX_PRS_BOX_3_ADDR     NRF_UARTE3
    // COMP, LPCOMP
    #define NRFX_PRS_BOX_4_ADDR     NRF_COMP
#elif defined(NRF5340_XXAA_NETWORK)
    // SPIM0, SPIS0, TWIM0, TWIS0, UARTE0
    #define NRFX_PRS_BOX_0_ADDR     NRF_UARTE0
#elif defined(NRF54H20_XXAA)
    // SPIM130, SPIS130, TWIM130, TWIS130, UARTE130
    #define NRFX_PRS_BOX_0_ADDR     NRF_UARTE130
    // SPIM131, SPIS131, TWIM131, TWIS131, UARTE131
    #define NRFX_PRS_BOX_1_ADDR     NRF_UARTE131
    // SPIM132, SPIS132, TWIM132, TWIS132, UARTE132
    #define NRFX_PRS_BOX_2_ADDR     NRF_UARTE132
    // SPIM133, SPIS133, TWIM133, TWIS133, UARTE133
    #define NRFX_PRS_BOX_3_ADDR     NRF_UARTE133
    // SPIM134, SPIS134, TWIM134, TWIS134, UARTE134
    #define NRFX_PRS_BOX_4_ADDR     NRF_UARTE134
    // SPIM135, SPIS135, TWIM135, TWIS135, UARTE135
    #define NRFX_PRS_BOX_5_ADDR     NRF_UARTE135
    // SPIM136, SPIS136, TWIM136, TWIS136, UARTE136
    #define NRFX_PRS_BOX_6_ADDR     NRF_UARTE136
    // SPIM137, SPIS137, TWIM137, TWIS137, UARTE137
    #define NRFX_PRS_BOX_7_ADDR     NRF_UARTE137
    // SPIM120, UARTE120
    #define NRFX_PRS_BOX_8_ADDR     NRF_UARTE120
    // COMP, LPCOMP
    #define NRFX_PRS_BOX_9_ADDR     NRF_COMP
#elif defined(NRF54L05_XXAA) || defined(NRF54L10_XXAA) || defined(NRF54L15_XXAA)
    // SPIM00, SPIS00, UARTE00
    #define NRFX_PRS_BOX_0_ADDR     NRF_UARTE00
    // SPIM20, SPIS20, TWIM20, TWIS20, UARTE20
    #define NRFX_PRS_BOX_1_ADDR     NRF_UARTE20
    // SPIM21, SPIS21, TWIM21, TWIS21, UARTE21
    #define NRFX_PRS_BOX_2_ADDR     NRF_UARTE21
    // SPIM22, SPIS22, TWIM22, TWIS22, UARTE22
    #define NRFX_PRS_BOX_3_ADDR     NRF_UARTE22
    // SPIM30, SPIS30, TWIM30, TWIS30, UARTE30
    #define NRFX_PRS_BOX_4_ADDR     NRF_UARTE30
    // COMP, LPCOMP
    #define NRFX_PRS_BOX_5_ADDR     NRF_COMP
#elif defined(NRF54LM20A_XXAA)
    // SPIM00, SPIS00, UARTE00
    #define NRFX_PRS_BOX_0_ADDR     NRF_UARTE00
    // SPIM20, SPIS20, TWIM20, TWIS20, UARTE20
    #define NRFX_PRS_BOX_1_ADDR     NRF_UARTE20
    // SPIM21, SPIS21, TWIM21, TWIS21, UARTE21
    #define NRFX_PRS_BOX_2_ADDR     NRF_UARTE21
    // SPIM22, SPIS22, TWIM22, TWIS22, UARTE22
    #define NRFX_PRS_BOX_3_ADDR     NRF_UARTE22
    // SPIM23, SPIS23, TWIM23, TWIS23, UARTE23
    #define NRFX_PRS_BOX_4_ADDR     NRF_UARTE23
    // SPIM24, SPIS24, TWIM24, TWIS24, UARTE23
    #define NRFX_PRS_BOX_5_ADDR     NRF_UARTE24
    // SPIM30, SPIS30, TWIM30, TWIS30, UARTE30
    #define NRFX_PRS_BOX_6_ADDR     NRF_UARTE30
    // COMP, LPCOMP
    #define NRFX_PRS_BOX_7_ADDR     NRF_COMP
#elif defined(NRF54LS05B_ENGA_XXAA)
    // SPIM20, SPIS20, TWIM20, TWIS20, UARTE20
    #define NRFX_PRS_BOX_0_ADDR     NRF_UARTE20
    // SPIM21, SPIS21, TWIM21, TWIS21, UARTE21
    #define NRFX_PRS_BOX_1_ADDR     NRF_UARTE21
    // SPIM32, SPIS32, TWIM32, TWIS32, UARTE32
    #define NRFX_PRS_BOX_2_ADDR     NRF_UARTE22
#elif defined(NRF54LV10A_ENGA_XXAA)
    // SPIM20, SPIS20, TWIM20, TWIS20, UARTE20
    #define NRFX_PRS_BOX_0_ADDR     NRF_UARTE20
    // SPIM21, SPIS21, TWIM21, TWIS21, UARTE21
    #define NRFX_PRS_BOX_1_ADDR     NRF_UARTE21
    // SPIM30, SPIS30, TWIM30, TWIS30, UARTE30
    #define NRFX_PRS_BOX_2_ADDR     NRF_UARTE30
    // COMP, LPCOMP
    #define NRFX_PRS_BOX_3_ADDR     NRF_COMP
#elif defined(NRF7120_ENGA_XXAA)
    // SPIM00, UARTE00
    #define NRFX_PRS_BOX_0_ADDR     NRF_UARTE00
    // SPIM01
    #define NRFX_PRS_BOX_1_ADDR     NRF_SPIM01
    // SPIM02
    #define NRFX_PRS_BOX_2_ADDR     NRF_SPIM02
    // SPIM20, SPIS20, TWIM20, TWIS20, UARTE20
    #define NRFX_PRS_BOX_3_ADDR     NRF_UARTE20
    // SPIM21, SPIS21, TWIM21, TWIS21, UARTE21
    #define NRFX_PRS_BOX_4_ADDR     NRF_UARTE21
    // SPIM22, SPIS22, TWIM22, TWIS22, UARTE22
    #define NRFX_PRS_BOX_5_ADDR     NRF_UARTE22
    // SPIM23, SPIS23, TWIM23, TWIS23, UARTE23
    #define NRFX_PRS_BOX_6_ADDR     NRF_UARTE23
    // SPIM24, SPIS24, TWIM24, TWIS24, UARTE24
    #define NRFX_PRS_BOX_7_ADDR     NRF_UARTE24
    // SPIM30, SPIS30, TWIM30, TWIS30, UARTE30
    #define NRFX_PRS_BOX_8_ADDR     NRF_UARTE30
    // COMP, LPCOMP
    #define NRFX_PRS_BOX_9_ADDR     NRF_COMP
#elif defined(NRF91_SERIES)
    // UARTE0, SPIM0, SPIS0, TWIM0, TWIS0
    #define NRFX_PRS_BOX_0_ADDR     NRF_UARTE0
    // UARTE1, SPIM1, SPIS1, TWIM1, TWIS1
    #define NRFX_PRS_BOX_1_ADDR     NRF_UARTE1
    // UARTE2, SPIM2, SPIS2, TWIM2, TWIS2
    #define NRFX_PRS_BOX_2_ADDR     NRF_UARTE2
    // UARTE3, SPIM3, SPIS3, TWIM3, TWIS3
    #define NRFX_PRS_BOX_3_ADDR     NRF_UARTE3
#elif defined(NRF9230_ENGB_XXAA)
    // SPIM130, SPIS130, TWIM130, TWIS130, UARTE130
    #define NRFX_PRS_BOX_0_ADDR     NRF_UARTE130
    // SPIM131, SPIS131, TWIM131, TWIS131, UARTE131
    #define NRFX_PRS_BOX_1_ADDR     NRF_UARTE131
    // SPIM132, SPIS132, TWIM132, TWIS132, UARTE132
    #define NRFX_PRS_BOX_2_ADDR     NRF_UARTE132
    // SPIM133, SPIS133, TWIM133, TWIS133, UARTE133
    #define NRFX_PRS_BOX_3_ADDR     NRF_UARTE133
    // SPIM134, SPIS134, TWIM134, TWIS134, UARTE134
    #define NRFX_PRS_BOX_4_ADDR     NRF_UARTE134
    // SPIM135, SPIS135, TWIM135, TWIS135, UARTE135
    #define NRFX_PRS_BOX_5_ADDR     NRF_UARTE135
    // SPIM136, SPIS136, TWIM136, TWIS136, UARTE136
    #define NRFX_PRS_BOX_6_ADDR     NRF_UARTE136
    // SPIM137, SPIS137, TWIM137, TWIS137, UARTE137
    #define NRFX_PRS_BOX_7_ADDR     NRF_UARTE137
    // SPIS120, UARTE120
    #define NRFX_PRS_BOX_8_ADDR     NRF_UARTE120
    // COMP, LPCOMP
    #define NRFX_PRS_BOX_9_ADDR     NRF_COMP
#endif

/* Definition of macro calculating HFXO internal capacitor value. */
#if defined(NRF5340_XXAA_APPLICATION)
#define OSCILLATORS_HFXO_CAP_CALCULATE(p_ficr_reg, cap_val)                   \
    (((((((p_ficr_reg->XOSC32MTRIM & FICR_XOSC32MTRIM_SLOPE_Msk)              \
       >> FICR_XOSC32MTRIM_SLOPE_Pos) + 56) * (uint32_t)(cap_val * 2 - 14)) + \
       ((((p_ficr_reg->XOSC32MTRIM & FICR_XOSC32MTRIM_OFFSET_Msk)             \
       >> FICR_XOSC32MTRIM_OFFSET_Pos) - 8) << 4)) + 32) >> 6)
#else
#define OSCILLATORS_HFXO_CAP_CALCULATE(p_ficr_reg, cap_val)                     \
      (((((p_ficr_reg->XOSC32MTRIM & FICR_XOSC32MTRIM_SLOPE_Msk)                \
         >> FICR_XOSC32MTRIM_SLOPE_Pos) + 791) * (uint32_t)(cap_val * 4 - 22) + \
        (((p_ficr_reg->XOSC32MTRIM & FICR_XOSC32MTRIM_OFFSET_Msk)               \
         >> FICR_XOSC32MTRIM_OFFSET_Pos) << 4)) >> 10)
#endif

#ifdef __cplusplus
}
#endif

#endif /* NRFX_SOC_DEFINES_H__ */
